#!/usr/bin/env python
# coding:utf-8


LEADING_ROLE_INIT_DATA = {
    'name' : "李磊",
    'cash' : 1000,
    'deposit' : 0,
    'hp' : 100,
    'rp' : 0,
    'ndays' : 0,
    'goods_list' : [],
    'max_goods_list' : 100
}

STORY = ['我有一个的女朋友，叫韩梅梅', '我们青梅竹马，顺理成章的到了谈婚论嫁的地步', '突然有一天一场无情的车祸将我穿越到了明朝', '当我醒来的时候时候，一个美丽的姑娘看着我']

GOODS_list = [
    {'name' : '大米', 'min' : 2, 'max' : 18},
    {'name' : '跌打酒', 'min' : 8, 'max' : 70},
    {'name' : '茶叶', 'min' : 125, 'max' : 407},
    {'name' : '丝绸', 'min' : 365, 'max' : 990},
    {'name' : '人参', 'min' : 530, 'max' : 1200},
    #{'name' : '东海夜明珠', 'min' : 10990, 'max' : 46224},
]

NEWS_LIST = [
    {'msg' : '隔壁村，爆发蝗灾，粮食欠收，爆发饥荒', 'id' : 0, 'impact' : 5.0},
    {'msg' : '粮食大丰收，很多人都开始做大米生意，大米一时卖不出去', 'id' : 0, 'impact' : -2.0},
    {'msg' : '官府发出告示，将征收米税', 'id' : 0, 'impact' : -1.5},
    {'msg' : '官府发出告示，西北战事，高价征收军粮', 'id' : 0 , 'impact' : 2.5},

    {'msg' : '最近帮派争斗严重，好多人受伤', 'id' : 1 , 'impact' : 6.0},
    {'msg' : '最近新开张了好多跌打馆，没人买跌打酒，跌打酒市场萎靡', 'id' : 1 , 'impact' : -2.1},
    {'msg' : '官府发出告示，禁止民间私斗', 'id' : 1 , 'impact' : -3.0},
    {'msg' : '最近武馆招生，大家纷纷去报名', 'id' : 1 , 'impact' : 2.5},

    {'msg' : '武夷山，雨水充足，茶叶大丰收', 'id' : 2, 'impact' : -1.5},
    {'msg' : '近来文人雅士流行品茗', 'id' : 2, 'impact' : 1.6},
    {'msg' : '城外匪患严重，没人出去贩茶', 'id' : 2, 'impact' : -2.2},
    {'msg' : '近来来了很多番邦商人，大量采购茶叶', 'id' : 2, 'impact' : 3.0},

    {'msg' : '家家户户养蚕，蚕茧价格暴跌', 'id' : 3, 'impact' : -1.8},
    {'msg' : '丝绸之路重开，人们纷纷踏上西去之路，贩卖丝绸', 'id' : 3, 'impact' : 3.1},
    {'msg' : '华府大量采购丝绸，为春夏秋冬四香做衣服', 'id' : 3, 'impact' : 2.5},
    {'msg' : '大量商人纷分做丝绸生意，丝绸严重滞销', 'id' : 3, 'impact' : -2.5},

    {'msg' : '大量高丽参涌入市场，人参价格暴跌', 'id' : 4, 'impact' : -2.3},
    {'msg' : '药材市场火爆，人们纷纷抱怨，病不起', 'id' : 4, 'impact' : 2.0},
    {'msg' : '官府告示：最近发现好多不法商贩，贩卖假人参骗人，提醒大家注意', 'id' : 3, 'impact' : -1.5},
    {'msg' : '人参燕窝鸡在富人中开始流行，人们纷纷开始效仿', 'id' : 4, 'impact' : 2.5},

    {'msg' : '最近帮派争斗严重，好多人受伤', 'id' : 1 , 'impact' : 6.0},
    {'msg' : '最近新开张了好多跌打馆，没人买跌打酒，跌打酒市场萎靡', 'id' : 1 , 'impact' : -2.1},
    {'msg' : '官府发出告示，禁止民间私斗', 'id' : 1 , 'impact' : -3.0},
    {'msg' : '最近武馆，大家纷纷去报名', 'id' : 1 , 'impact' : 2.5},
]

INTERESTS = 0.05

MAX_HP = 100
MAX_RP = 100
MAX_DAY = 60


PROSTITUTE_PRICE = 500


SAVE_FILE = 'save/save.pkl'

OVER_DAY = 60
WIN_CASH = 1000000
WIN_RP = 50
WIN_LOVE = 50
LOSE_HP = 0

